{"date":"2019-04-11T15:03:30Z","user":"ejfox","posts":[{"href":"https://www.gwern.net/Silk-Road","description":"Silk Road 1: Theory & Practice","extended":"The cardinal example is the April 2012 scam where a trusted seller took the occasion of a SR-wide sales event (where SR waived its fees) to announce unusually low prices, took in hundreds of large orders totaling thousands of bitcoins (the equivalent of >$50,000) but requiring early finalization, withdrew all funds, and never delivered. A simple enough scam, yet highly effective: as May and other cypherpunks pointed out decades before, one should never entrust a pseudonymous agent with more liquid anonymous cash than its “reputation capital” is worth! One can entrust the agent with less liquid anonymous cash (not enough to burn one’s reputation in exchange for), or one could entrust the agent with more escrowed anonymous cash (so they cannot “rip-and-run”), but not both more and un-escrowed (which is paying them to scam you).","meta":"62ae3435253ea8b707b7b6b040a3113a","hash":"7e2b18a36e0ac89fe174f625f0a4cc0e","time":"2019-04-11T15:03:30Z","shared":"yes","toread":"no","tags":"crypto security"},{"href":"https://unix.stackexchange.com/questions/321282/how-do-i-sort-files-into-a-sub-folder-based-on-filename-part","description":"command line - How do I sort files into a sub-folder based on filename part? - Unix & Linux Stack Exchange","extended":"> mkdir Mustang Impala\r\n> mv *Mustang*.jpg Mustang/\r\n> mv *Impala*.jpg Impala/","meta":"2c916fc81709749c3fa56bef396cfe4c","hash":"ce2b11daf3445700f7f868671c231da1","time":"2019-04-11T15:37:21Z","shared":"yes","toread":"no","tags":""},{"href":"https://www.gwern.net/About","description":"About This Website - Gwern.net","extended":"To the extent I personally have any method for ‘getting started’ on writing something, it’s to pay attention to anytime you find yourself thinking, “how irritating that there’s no good webpage/Wikipedia article on X” or “I wonder if Y” or “has anyone done Z” or “huh, I just realized that A!” or “this is the third time I’ve had to explain this, jeez.”","meta":"7a3b6dfd8622b982a212b95046d8b3d8","hash":"042bf6233212fdb39a19dd156aee4c5b","time":"2019-04-11T17:16:23Z","shared":"yes","toread":"no","tags":"writing"},{"href":"https://www.theatlantic.com/ideas/archive/2019/04/julian-assange-arrested-journalists-defend/586936/","description":"Julian Assange Was Arrested. Journalists Must Defend Him. - The Atlantic","extended":"The combination of an ideologically-motivated (rather than financial) whistleblower with firsthand knowledge of the material they give alongside the editorial judgment of major outlets forms the bedrock of public interest journalism. Any attempt to swing the needle against that, or to criminalize it by tying it to hacking on a technicality, threatens quality journalism and threatens the free media. More simply than that, while Julian Assange may deserve punishment for other things he is accused of having done in his life, he does not deserve to be punished for what he published in 2010. Barring some new and major revelation, neither extradition nor prosecution over his work with WikiLeaks is merited.","meta":"2200512f1d8d3492f3a89eca15eaa007","hash":"d2bf63623f52536e49013d9f36024473","time":"2019-04-11T20:17:17Z","shared":"yes","toread":"no","tags":""}]}