{"date":"2019-04-23T14:05:05Z","user":"ejfox","posts":[{"href":"https://en.wikipedia.org/wiki/Servant_leadership","description":"Servant leadership","extended":"Servant leadership is a leadership philosophy in which the main goal of the leader is to serve. This is different from traditional leadership where the leader's main focus is the thriving of their company or organizations. A Servant Leader shares power, puts the needs of the employees first and helps people develop and perform as highly as possible.","meta":"e55a885061ff4ef3e810e40c17b832c2","hash":"944efc89a7a2ed1aec32905919329de4","time":"2019-04-23T14:05:05Z","shared":"yes","toread":"no","tags":""},{"href":"https://www.civilized.life/articles/microdosing-for-depression/","description":"Why People Are Microdosing for Depression","extended":"In a study published in The Lancet, researchers treated 12 people diagnosed with a treatment-resistant depressive disorder with two microdoses of psilocybin, seven days apart. The researchers found that though some transient adverse effects occurred — mostly a little anxiety at the beginning of the session, some confusion and nausea during the session — there were no lasting adverse effects. The beneficial effects, however, did seem to hold up. All of the patients showed a marked reduction in depressive symptoms at one-week and three-month follow-up assessments, as well as improvement in symptoms of anxiety.","meta":"d4cc762362a3c0ebb7ca2fbe07fa6b36","hash":"4b82df6c62a52c11c0788ee91cdba00a","time":"2019-04-23T15:33:26Z","shared":"yes","toread":"no","tags":"psychedelics health"},{"href":"https://www.psychologytoday.com/us/blog/the-athletes-way/201811/is-your-brain-microdoses-psilocybin","description":"This Is Your Brain on Microdoses of Psilocybin","extended":"","meta":"e01db434c2e6a410a1bc1e223e374c09","hash":"98707b47b3dba0d2b46de3d74c3d0100","time":"2019-04-23T15:34:37Z","shared":"yes","toread":"no","tags":"health"},{"href":"https://blog.mozvr.com/voxeljs-next/","description":"VoxelJS Reboot","extended":"VoxelJS Next is a graphics engine, not a game. I think of Minecraft as a category of game, not a particular instance. I’d like to see Minecraft style voxels used for all sorts of experiences. Chemistry, water simulation, infinite runners, and many other fun experiences.","meta":"d147ad34fc002b8276c47aba82fb6d6e","hash":"38dacda91ad155d310d701165779490d","time":"2019-04-23T18:43:19Z","shared":"yes","toread":"no","tags":"dataviz vr"},{"href":"https://www.wired.com/story/colorado-quadratic-voting-experiment/","description":"Colorado Tried a New Way to Vote: Make People Pay—Quadratically","extended":"Maybe the nation’s seemingly intractable political divisions aren’t a product of Russians, racism, and algorithms but a system that doesn’t let everyone speak with an authentic voice. “Many of these methods have advantages, and most of the experts agree that those other methods are preferable,” says Dan Ullman","meta":"d49d2c7af72334583763872987d27778","hash":"a2be1bbad99eda2ffddc0ce146f9f282","time":"2019-04-23T20:08:49Z","shared":"yes","toread":"no","tags":""},{"href":"https://github.com/DemocracyEarth/paper","description":"DemocracyEarth/paper: 📄 On decentralized digital democracy.","extended":"With internet growth reaching over 3 billion lives (far surpassing major religions and Nation-States) and the development of encrypted networks known as blockchains permitting incorruptible transactions with permissionless audits, there’s no reason stopping mankind from building a borderless commons that can help shape the next evolutionary leap for democratic governance at any scale.","meta":"3256e21a1fff50cf19069a86b347f7ef","hash":"31c50bd32b1f5b810e402e80a03b84a7","time":"2019-04-23T20:12:08Z","shared":"yes","toread":"no","tags":"politics crypto"}]}