{"date":"2019-03-20T05:25:22Z","user":"ejfox","posts":[{"href":"https://www.documentcloud.org/documents/5763099-NICAR-Doxxing-Handout.html","description":"NICAR Doxxing Handout","extended":"","meta":"4e1855aed492aa1d60327b0622b9bd3d","hash":"7f8c6b0f76685d78f452370576812333","time":"2019-03-20T05:25:22Z","shared":"yes","toread":"no","tags":""},{"href":"https://github.com/nomic-io/lotion","description":"nomic-io/lotion: ✨ Smooth, easy blockchain apps ✨","extended":"Lotion lets you build blockchains. At any moment in time, the whole state of your blockchain is represented by a single JavaScript object called the state.\r\n\r\nUsers will create transactions: JavaScript objects that tell the application how to mutate the blockchain's state.\r\n\r\nEvery user who runs your Lotion app will interact with the same blockchain. Anyone can create a transaction, and it will automagically find its way to everyone else running the app and mutate their state. Everyone's state objects will constantly be kept in sync with each other.","meta":"fc859bdaed745b1bb8b8194684bd0937","hash":"5a3429b85b6c20a8c034e50e766f9aca","time":"2019-03-20T05:48:16Z","shared":"yes","toread":"no","tags":"javascript crypto"},{"href":"https://medium.com/xcblog/generating-jwt-tokens-for-app-store-connect-api-2b2693812a35","description":"Generating JWT Tokens for App Store Connect API – XCBlog – Medium","extended":"As mentioned earlier, JWT is used to generate the token that has been used by App Store Connect API. The process of generating token requires following six details\r\n\r\nIssuer ID: The ID found on the top of App Store Connect\r\nPrivate Key ID: The ID associated with Private Key on App Store Connect\r\nExpiration Time: 20 min maximum, the token cannot be valid more than 20 min so that we have to make sure that, we will create new token before it expires.\r\nAudience: This is constant with API version value usually “applestoreconnect-v1”\r\nAlgorithm: This is JWT algorithm required to generate token e.g ES256","meta":"87b4083581d20e72ff55dc6173065222","hash":"71ed066b3e62a76883476379f8118e3d","time":"2019-03-20T17:35:21Z","shared":"yes","toread":"no","tags":""},{"href":"https://www.drawcutinkpress.com/linocutting-exercises-for-beginners/","description":"Linocutting Exercises for Beginners - Draw Cut Ink Press","extended":"I would encourage any beginners out there to practice some of the following exercises that I found in a small book called ‘The Art of Linocutting’, published in 1936 and written by Len A. Doust.","meta":"099bd9ab65a7823966b5cb09169ad24e","hash":"89adbf7d140388be9c55d4b4454d2205","time":"2019-03-20T22:27:40Z","shared":"yes","toread":"no","tags":""},{"href":"https://emma.best/2019/03/20/the-russian-contractor-who-infiltrated-anonymous/","description":"Leaker, Liar, Hacker, Hoaxer: The Russian contractor who infiltrated Anonymous – Emma Best","extended":"","meta":"6d02e972a6b8a0881b97ae9f111eea1c","hash":"9291a146c0baec427255ac50eff67134","time":"2019-03-20T22:37:16Z","shared":"yes","toread":"yes","tags":""}]}