{"date":"2019-06-13T13:52:49Z","user":"ejfox","posts":[{"href":"http://arep.med.harvard.edu/gmc/protect.html","description":"Protective alleles","extended":"\"Harvard geneticist George Church, famous for his plan to resurrect the woolly mammoth, has been assembling a list of genetic mutations and alterations that could give people longer lives and superhuman powers.\"","meta":"36cd440f355a9cdd8e189d7048e1b053","hash":"3dbf40c60e8854f55770415a5e616ebc","time":"2019-06-13T13:52:49Z","shared":"yes","toread":"no","tags":""},{"href":"https://medium.com/lastnightsparty/conquering-the-fear-of-doing-nothing-dc878127d8a8?pix=a_0_0","description":"Conquering The Fear Of Doing Nothing – The Drive-By Mentality","extended":"Drive-by photographers are just like those National Geographic photographers that wait for weeks to capture a special moment. We stay ready until the next special encounter. That’s our job: stay ready.","meta":"abdb1e9ac8a28ea8af19f4e7aba12f68","hash":"8fab229690e39eee380c4f0fe6bd3f1b","time":"2019-06-13T14:38:51Z","shared":"yes","toread":"no","tags":""},{"href":"https://blog.twitter.com/en_us/topics/company/2019/information-ops-on-twitter.html","description":"Information operations on Twitter: principles, process, and disclosure","extended":"Non-peer reviewed research using our public API can often be deeply flawed. We see a lot of commercially-driven and non-peer reviewed research that make sweeping assessments of account behaviors only using public signals, such as location (if cited), account content, how often an account Tweets, and the accounts it follows. To be clear: none of these indicators are sufficient to determine attribution to a state entity definitively. Looking for accounts that look similar to those disclosed as part of our archives is an equally flawed approach, given many of the bad actors mimic legitimate accounts to appear credible. This approach also often wrongly captures legitimate voices who share a particular political viewpoint that one disagrees with.","meta":"12ae8f62b4fae796ac1787909744c3f4","hash":"78f955d71d377120d4deb173aec972ea","time":"2019-06-13T20:35:01Z","shared":"yes","toread":"no","tags":"data"}]}