{"date":"2019-03-23T15:49:01Z","user":"ejfox","posts":[{"href":"https://www.latimes.com/business/technology/la-fi-tn-uber-driver-strike-la-pay-cut-20190323-story.html","description":"‘I'm really struggling’: Facing pay cuts, some ride-hailing drivers prepare to strike - Los Angeles Times","extended":"While the organizers want to eventually secure a place among the established unions, the focus now is on spreading the word among a diffuse workforce.\n“This is about person-to-person organizing,” Moore said.\n\nOne method is through an app they’ve built that matches organizers with drivers who have expressed interest in their campaign. Organizers discuss drivers’ concerns, promote the strike and identify potential leaders. Keodara — who can’t afford to take any time off from driving — said it allows him to stay involved.","meta":"ef0f209528b00abf493d57a8add44f1d","hash":"7968f03e6a7d392509357b09aa25c284","time":"2019-03-23T15:49:01Z","shared":"yes","toread":"no","tags":""},{"href":"https://patrickcollison.com/advice","description":"Advice · Patrick Collison","extended":"- Don't stress out too much about how valuable the things you're going deep on are... but don't ignore it either. It should be a factor you weigh but not by itself dispositive.\r\n- Make friends over the internet with people who are great at things you're interested in. The internet is one of the biggest advantages you have over prior generations. Leverage it.","meta":"6e9cd2a7c3e4a3ea6232e4df63a1225a","hash":"e3ee52222265cb0cb39c4b2f2d07b853","time":"2019-03-23T18:41:23Z","shared":"yes","toread":"no","tags":""},{"href":"https://www.wired.com/story/wired25-stewart-brand-whole-earth/","description":"Stewart Brand and the Tools to Make the Whole Earth Better | WIRED","extended":"Surveying the landscape that formed and energized WIRED, you can’t avoid the mythic stuff of Brand: He was one of Ken Kesey’s Merry Pranksters, as immortalized in Tom Wolfe’s Electric Kool-Aid Acid Test. He worked with Douglas Engelbart on “The Mother of All Demos,” which in 1968 introduced hypertext, email, the mouse. He created the Whole Earth Catalog and its descendants­; he founded CoEvolution Quarterly.","meta":"59385f33bdd934f1f8fcd22999c1e890","hash":"6e6b77f36256217a9ee47a49ac37c3cb","time":"2019-03-23T18:43:55Z","shared":"yes","toread":"no","tags":"hackers activism inspiration"},{"href":"https://medium.com/@satorid23/how-the-sixties-counterculture-shaped-the-personal-computer-industry-b34192c79780","description":"How the Sixties Counterculture Shaped the Personal Computer Industry","extended":"In Markoff’s view, it was characterized by a bohemian sensibility that was open to experiments in alternative living arrangements, a disposition to anti-establishment politics (especially opposition to the military-industrial complex and its war in Vietnam), and a willingness to experiment with altered psychic states, especially through ingesting and inhaling certain substances. More fundamentally, in Markoff’s account of the period, what was shared by the hippies and the personal computing pioneers based in and around Stanford was a commitment to transforming the world and the nature of humanity in a fundamental way — bringing about a change that hadn’t come before.","meta":"60a7274aa2d9ae78442bf8baa465d910","hash":"7170fdc99f9dbfc375b2f9b2d9957bf6","time":"2019-03-23T18:51:10Z","shared":"yes","toread":"no","tags":""}]}