{"date":"2019-03-31T17:24:57Z","user":"ejfox","posts":[{"href":"https://www.theguardian.com/technology/2004/nov/04/onlinesupplement","description":"Neal Stephenson - the interview","extended":"NS: For a while I have been nursing the idea that open source software is just the extension of Common Law into the realm of executable code. I daren't think I'm the first person to have thought such a thing, so I did a Google search and found some references to the idea elsewhere. It appears that Michael Tiemann of Cygnus Support (an open source software company) has been thinking along similar lines, and perhaps there are others too. It's certainly the case that commonly used Internet protocols such as TCP/IP and HTTP have attained a status akin to that of common law.\r\n\r\nAssuming one is willing to buy that analogy, then your question boils down to whether the development of this new branch of common law amounts to a heroic purpose. I believe that it is a great purpose and that it can affect society in ways that are more important and far-reaching than heroism in the glorious, swashbuckling sense. It is not, however, glorious and swashbuckling, any more than were all the efforts made by lawyers and magistrates over many centuries to build Common Law. This comes out of the fact that the development of open source software is of necessity a collective enterprise. Unless many people all over the world buy into it, it doesn't get developed, it doesn't get maintained, and it will not be widely adopted. Solitary geniuses need not apply; social and organizational skills are of the essence.","meta":"f7954e28bafe810f380588208ded562b","hash":"e94cd5aa57ae02886ec600b126d096ae","time":"2019-03-31T17:24:57Z","shared":"yes","toread":"no","tags":"hackers opensource"},{"href":"https://jacobinmag.com/2019/03/middle-class-white-collar-unions-kickstarter","description":"Forget Your Middle-Class Dreams","extended":"","meta":"1aeb93b7639f4e74433958fe9dfdcf7f","hash":"e1a1beae96db48f7fada7551817553bd","time":"2019-03-31T22:46:15Z","shared":"yes","toread":"no","tags":""},{"href":"http://www.iching123.com/wording_a_text.htm","description":"terminology of the i ching: the meaning of some wordings","extended":"","meta":"8165606281e039f20c9b998c8fc3dd5f","hash":"3d84f5e6782d628a5372956c9c4f375d","time":"2019-03-31T23:15:26Z","shared":"yes","toread":"no","tags":""},{"href":"https://medium.com/disruptive-design/system-failures-the-education-system-and-the-proliferation-of-reductive-thinking-dccf7dbb9b96","description":"System Failures: The Education System and the Proliferation of Reductive Thinking","extended":"","meta":"6195268e5d9bf9bf88b06b49e95564ee","hash":"22f1c6c012c8bfa7595a9312d2920ffe","time":"2019-03-31T01:41:12Z","shared":"yes","toread":"yes","tags":""}]}