{"date":"2019-05-02T00:00:21Z","user":"ejfox","posts":[{"href":"https://www.foodandwine.com/blogs/coffee-conundrum","description":"How Much Caffeine is Really in Coffee | Food & Wine","extended":"There's a classic caffeine study in which a researcher bought a 16-ounce Breakfast Blend from the same Starbucks on six consecutive days and found that the caffeine content fluctuated wildly, swinging from 259 to 564 milligrams. That’s analogous to a bottle of wine suddenly turning into whiskey","meta":"4aa2e80a2284e7369845e9593e9a5b5d","hash":"c7d786f6e41088a97fb7a1ecefcea7a7","time":"2019-05-02T00:00:21Z","shared":"yes","toread":"no","tags":"health"},{"href":"https://en.wikipedia.org/wiki/Simulacra_and_Simulation","description":"Simulacra and Simulation - Wikipedia","extended":"+ The first stage is a faithful image/copy, where we believe, and it may even be correct...\r\n+ The second stage is perversion of reality, this is where we come to believe the sign to be an unfaithful copy... but can hint at the existence of an obscure reality which the sign itself is incapable of encapsulating.\r\n+ The third stage masks the absence of a profound reality, where the sign pretends to be a faithful copy, but it is a copy with no original. Signs and images claim to represent something real, but no representation is taking place and arbitrary images are merely suggested as things which they have no relationship to.\r\n+ The fourth stage is pure simulacrum, in which the simulacrum has no relationship to any reality whatsoever.","meta":"4452a337dc8e00b099df9dd3d04ddd72","hash":"08478bda4b7d2e079897afdf3910119e","time":"2019-05-02T01:52:55Z","shared":"yes","toread":"no","tags":"book"},{"href":"http://www.untrammeledmind.com/2017/07/nassim-talebs-fat-tony-example-and-is-it-possible-to-flip-100-heads-in-a-row/","description":"Nassim Taleb's Fat Tony Example / And: Is it possible to flip 100 Heads in a row? | Untrammeled Mind","extended":"> Assume that a coin is fair, i.e., has an equal probability of coming up heads or tails when flipped. I flip it ninety-nine times and get heads each time. What are the odds of my getting tails on my next throw?\r\n\r\n> Dr. John refers to the question as trivial and gives the mathematically correct answer of one half. Fat Tony calls Dr. John a sucker and says, “no more than 1 percent, of course … the coin gotta be loaded.”","meta":"51d8ddc300ab0b57e6b3e7ff79aa5edb","hash":"18590d5d18c32fe5de1c569ce88a82dd","time":"2019-05-02T02:05:01Z","shared":"yes","toread":"no","tags":""},{"href":"https://www.logicallyfallacious.com/tools/lp/Bo/LogicalFallacies/121/Ludic-Fallacy","description":"Ludic Fallacy","extended":"Chaos theory plays a huge role in our universe, and it is way beyond the scope of this book.  As for this fallacy, many things that appear to be random are actually chaotic systems, or unpredictable, deterministic systems.  Attempting to apply the rules of random probability in those cases will result in all kinds of errors.\r\n\r\n","meta":"6ce94411914291292a45590f5f8b4680","hash":"b8be85888f6ebf16f04c52d3f5bed32f","time":"2019-05-02T02:06:12Z","shared":"yes","toread":"no","tags":""},{"href":"http://www.lifeafterdeathexperiences.com/?p=4660","description":"Life After Death Experiences – Is Life a Simulation","extended":"> From my experiences during a deep-dive 10-day meditation process, I experienced a non-physical aspect of myself, a True Self, that exists outside of space-time, that incarnates repeatedly into space-time, living multiple lives in our physical reality.  This, along with my experience of the basketball universes that stored each moment of now (including the limitless probabilities of future and past nows), and my experience that each of us creates our own basketball universes from a common pattern of reality","meta":"fd412c0e851e0682e9d47c1fa2785503","hash":"d7f2cbefda5201d191cdbc90d379e781","time":"2019-05-02T02:18:01Z","shared":"yes","toread":"no","tags":""},{"href":"https://www.dezeen.com/2017/11/23/frank-kolkman-outrospectre-near-death-experience-virtual-reality-technology-robots-health/","description":"Frank Kolkman creates death simulation machine using virtual reality","extended":"To tackle \"death anxiety\" among terminally ill hospital patients, designer Frank Kolkman has created a device that simulates a near-death experience using virtual reality.","meta":"a0d194369cd4d9c7cc8e4e0daf5a949b","hash":"9a90a2ce23534d8bfa4ea6d5c920d0eb","time":"2019-05-02T02:21:01Z","shared":"yes","toread":"no","tags":""},{"href":"https://embeddedsw.net/doc/legal_coercion.html","description":"Self Incrimination and Cryptographic Keys","extended":"","meta":"4bca9aa34a2ad93af9fae368b83ccabd","hash":"e7a8d0e82ef8df2b4c9b0f30b7a2f0f3","time":"2019-05-02T01:22:57Z","shared":"yes","toread":"yes","tags":""}]}